flyghost/OneOS-V2.1.0/templates/stm32mp157-common/cm4/board/startup/startup_stm32mp15xx_arm.s
;******************************************************************************
;* File Name          : startup_stm32mp15xx.s
;* Author             : MCD Application Team
;* Description        : STM32MP15xx devices vector table for MDK-ARM toolchain.
;*                      This module performs:
;*                      - Set the initial SP
;*                      - Set the initial PC == Reset_Handler
;*                      - Set the vector table entries with the exceptions ISR address
;*                      - Branches to __main in the C library (which eventually
;*                        calls main()).
;*                      After Reset the CortexM4 processor is in Thread mode,
;*                      priority is Privileged, and the Stack is set to Main.
;****************************************************************************** 
;* @attention
;*
;* <h2><center>&copy; Copyright (c) 2019 STMicroelectronics. 
;* All rights reserved.</center></h2>
;*
;* This software component is licensed by ST under BSD 3-Clause license,
;* the "License"; You may not use this file except in compliance with the 
;* License. You may obtain a copy of the License at:
;*                        opensource.org/licenses/BSD-3-Clause
;*
;******************************************************************************
;* <<< Use Configuration Wizard in Context Menu >>>
;
; Amount of memory (in bytes) allocated for Stack
; Tailor this value to your application needs
; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x00000400

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
__stack_limit
Stack_Mem       SPACE   Stack_Size
__initial_sp
___initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Heap_Size       EQU     0x00000200

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit

                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size
                EXPORT  ___initial_sp

__Vectors       DCD      __initial_sp                        ;     Top of Stack
                DCD      Reset_Handler                       ;     Reset Handler
                DCD      NMI_Handler                         ; -14 NMI Handler
                DCD      HardFault_Handler                   ; -13 Hard Fault Handler
                DCD      MemManage_Handler                   ; -12 MPU Fault Handler
                DCD      BusFault_Handler                    ; -11 Bus Fault Handler
                DCD      UsageFault_Handler                  ; -10 Usage Fault Handler
                DCD      0                                   ;     Reserved
                DCD      0                                   ;     Reserved
                DCD      0                                   ;     Reserved
                DCD      0                                   ;     Reserved
                DCD      SVC_Handler                         ;  -5 SVCall Handler
                DCD      DebugMon_Handler                    ;  -4 Debug Monitor Handler
                DCD      0                                   ;     Reserved
                DCD      PendSV_Handler                      ;  -2 PendSV Handler
                DCD      SysTick_Handler                     ;  -1 SysTick Handler

                ; Interrupts
                DCD     WWDG1_IRQHandler                     ;
                DCD     PVD_AVD_IRQHandler                   ;
                DCD     TAMP_IRQHandler                      ;
                DCD     RTC_WKUP_ALARM_IRQHandler            ;
                DCD     RESERVED4_IRQHandler                 ;
                DCD     RCC_IRQHandler                       ;
                DCD     EXTI0_IRQHandler                     ;
                DCD     EXTI1_IRQHandler                     ;
                DCD     EXTI2_IRQHandler                     ;
                DCD     EXTI3_IRQHandler                     ;
                DCD     EXTI4_IRQHandler                     ;
                DCD     DMA1_Stream0_IRQHandler              ;
                DCD     DMA1_Stream1_IRQHandler              ;
                DCD     DMA1_Stream2_IRQHandler              ;
                DCD     DMA1_Stream3_IRQHandler              ;
                DCD     DMA1_Stream4_IRQHandler              ;
                DCD     DMA1_Stream5_IRQHandler              ;
                DCD     DMA1_Stream6_IRQHandler              ;
                DCD     ADC1_IRQHandler                      ;
                DCD     FDCAN1_IT0_IRQHandler                ;
                DCD     FDCAN2_IT0_IRQHandler                ;
                DCD     FDCAN1_IT1_IRQHandler                ;
                DCD     FDCAN2_IT1_IRQHandler                ;
                DCD     EXTI5_IRQHandler                     ;
                DCD     TIM1_BRK_IRQHandler                  ;
                DCD     TIM1_UP_IRQHandler                   ;
                DCD     TIM1_TRG_COM_IRQHandler              ;
                DCD     TIM1_CC_IRQHandler                   ;
                DCD     TIM2_IRQHandler                      ;
                DCD     TIM3_IRQHandler                      ;
                DCD     TIM4_IRQHandler                      ;
                DCD     I2C1_EV_IRQHandler                   ;
                DCD     I2C1_ER_IRQHandler                   ;
                DCD     I2C2_EV_IRQHandler                   ;
                DCD     I2C2_ER_IRQHandler                   ;
                DCD     SPI1_IRQHandler                      ;
                DCD     SPI2_IRQHandler                      ;
                DCD     USART1_IRQHandler                    ;
                DCD     USART2_IRQHandler                    ;
                DCD     USART3_IRQHandler                    ;
                DCD     EXTI10_IRQHandler                    ;
                DCD     RTC_TIMESTAMP_IRQHandler             ;
                DCD     EXTI11_IRQHandler                    ;
                DCD     TIM8_BRK_IRQHandler                  ;
                DCD     TIM8_UP_IRQHandler                   ;
                DCD     TIM8_TRG_COM_IRQHandler              ;
                DCD     TIM8_CC_IRQHandler                   ;
                DCD     DMA1_Stream7_IRQHandler              ;
                DCD     FMC_IRQHandler                       ;
                DCD     SDMMC1_IRQHandler                    ;
                DCD     TIM5_IRQHandler                      ;
                DCD     SPI3_IRQHandler                      ;
                DCD     UART4_IRQHandler                     ;
                DCD     UART5_IRQHandler                     ;
                DCD     TIM6_IRQHandler                      ;
                DCD     TIM7_IRQHandler                      ;
                DCD     DMA2_Stream0_IRQHandler              ;
                DCD     DMA2_Stream1_IRQHandler              ;
                DCD     DMA2_Stream2_IRQHandler              ;
                DCD     DMA2_Stream3_IRQHandler              ;
                DCD     DMA2_Stream4_IRQHandler              ;
                DCD     ETH1_IRQHandler                      ;
                DCD     ETH1_WKUP_IRQHandler                 ;
                DCD     FDCAN_CAL_IRQHandler                 ;
                DCD     EXTI6_IRQHandler                     ;
                DCD     EXTI7_IRQHandler                     ;
                DCD     EXTI8_IRQHandler                     ;
                DCD     EXTI9_IRQHandler                     ;
                DCD     DMA2_Stream5_IRQHandler              ;
                DCD     DMA2_Stream6_IRQHandler              ;
                DCD     DMA2_Stream7_IRQHandler              ;
                DCD     USART6_IRQHandler                    ;
                DCD     I2C3_EV_IRQHandler                   ;
                DCD     I2C3_ER_IRQHandler                   ;
                DCD     USBH_OHCI_IRQHandler                 ;
                DCD     USBH_EHCI_IRQHandler                 ;
                DCD     EXTI12_IRQHandler                    ;
                DCD     EXTI13_IRQHandler                    ;
                DCD     DCMI_IRQHandler                      ;
                DCD     CRYP1_IRQHandler                     ;
                DCD     HASH1_IRQHandler                     ;
                DCD     FPU_IRQHandler                       ;
                DCD     UART7_IRQHandler                     ;
                DCD     UART8_IRQHandler                     ;
                DCD     SPI4_IRQHandler                      ;
                DCD     SPI5_IRQHandler                      ;
                DCD     SPI6_IRQHandler                      ;
                DCD     SAI1_IRQHandler                      ;
                DCD     LTDC_IRQHandler                      ;
                DCD     LTDC_ER_IRQHandler                   ;
                DCD     ADC2_IRQHandler                      ;
                DCD     SAI2_IRQHandler                      ;
                DCD     QUADSPI_IRQHandler                   ;
                DCD     LPTIM1_IRQHandler                    ;
                DCD     CEC_IRQHandler                       ;
                DCD     I2C4_EV_IRQHandler                   ;
                DCD     I2C4_ER_IRQHandler                   ;
                DCD     SPDIF_RX_IRQHandler                  ;
                DCD     OTG_IRQHandler                       ;
                DCD     RESERVED99_IRQHandler                ;
                DCD     IPCC_RX0_IRQHandler                  ;
                DCD     IPCC_TX0_IRQHandler                  ;
                DCD     DMAMUX1_OVR_IRQHandler               ;
                DCD     IPCC_RX1_IRQHandler                  ;
                DCD     IPCC_TX1_IRQHandler                  ;
                DCD     CRYP2_IRQHandler                     ;
                DCD     HASH2_IRQHandler                     ;
                DCD     I2C5_EV_IRQHandler                   ;
                DCD     I2C5_ER_IRQHandler                   ;
                DCD     GPU_IRQHandler                       ;
                DCD     DFSDM1_FLT0_IRQHandler               ;
                DCD     DFSDM1_FLT1_IRQHandler               ;
                DCD     DFSDM1_FLT2_IRQHandler               ;
                DCD     DFSDM1_FLT3_IRQHandler               ;
                DCD     SAI3_IRQHandler                      ;
                DCD     DFSDM1_FLT4_IRQHandler               ;
                DCD     TIM15_IRQHandler                     ;
                DCD     TIM16_IRQHandler                     ;
                DCD     TIM17_IRQHandler                     ;
                DCD     TIM12_IRQHandler                     ;
                DCD     MDIOS_IRQHandler                     ;
                DCD     EXTI14_IRQHandler                    ;
                DCD     MDMA_IRQHandler                      ;
                DCD     DSI_IRQHandler                       ;
                DCD     SDMMC2_IRQHandler                    ;
                DCD     HSEM_IT2_IRQHandler                  ;
                DCD     DFSDM1_FLT5_IRQHandler               ;
                DCD     EXTI15_IRQHandler                    ;
                DCD     nCTIIRQ1_IRQHandler                  ;
                DCD     nCTIIRQ2_IRQHandler                  ;
                DCD     TIM13_IRQHandler                     ;
                DCD     TIM14_IRQHandler                     ;
                DCD     DAC_IRQHandler                       ;
                DCD     RNG1_IRQHandler                      ;
                DCD     RNG2_IRQHandler                      ;
                DCD     I2C6_EV_IRQHandler                   ; 
                DCD     I2C6_ER_IRQHandler                   ;
                DCD     SDMMC3_IRQHandler                    ;
                DCD     LPTIM2_IRQHandler                    ;
                DCD     LPTIM3_IRQHandler                    ;
                DCD     LPTIM4_IRQHandler                    ;
                DCD     LPTIM5_IRQHandler                    ;
                DCD     ETH1_LPI_IRQHandler                  ;
                DCD     RESERVED143_IRQHandler               ;
                DCD     MPU_SEV_IRQHandler                   ;
                DCD     RCC_WAKEUP_IRQHandler                ;
                DCD     SAI4_IRQHandler                      ;
                DCD     DTS_IRQHandler                       ;
                DCD     RESERVED148_IRQHandler               ;
                DCD     WAKEUP_PIN_IRQHandler                ;

                SPACE    (73 * 4)                            ; Interrupts 151 .. 224 are left out
__Vectors_End
__Vectors_Size  EQU      __Vectors_End - __Vectors


